## Mysql (Filter (Where Clause) & Sort)

### Create an Excel with data of Student database and add all the values which is required for student management database, Read the excel file and add the datas into a DB.

In [1]:
from openpyxl import load_workbook

In [3]:
wb = load_workbook("students_dbm.xlsx")
ws = wb.active

In [5]:
cell_obj = ws.cell(row=2, column=2)
print(cell_obj.value)

Arthur

In [8]:
# print one Student details
for i in range(1,9):
    for j in range(1,3):
        cell = ws.cell(row=j, column=i)
        print(cell.value, end=' ')
    print()

Reg-No 6001
Name Arthur
Gender Male
Department ECE
CGPA 8.4
Address Chennai
Contact-No 987654321
mail-Id arthur@gmail.com

In [9]:
import mysql.connector

In [11]:
con = mysql.connector.connect(host="localhost",user="root",passwd="Microsoft@9623")
print(con)

<mysql.connector.connection.MySQLConnection object at 0x000001F75229F8B0>

In [13]:
dbase = con.cursor()
dbase.execute("SHOW DATABASES")
for i in dbase:
    print(i)

('doctor',)
('information_schema',)
('mydatabase',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [41]:
dbase.execute("CREATE DATABASE Student_DBM")

In [42]:
con = mysql.connector.connect(host="localhost",user="root",passwd="Microsoft@9623", database="Student_DBM")
print(con)

<mysql.connector.connection.MySQLConnection object at 0x000001F7531F3700>

In [44]:
dbase = con.cursor()
dbase.execute("SHOW DATABASES")
for i in dbase:
    print(i)

('doctor',)
('information_schema',)
('mydatabase',)
('mysql',)
('performance_schema',)
('sakila',)
('student_dbm',)
('sys',)
('world',)

In [45]:
dbase.execute("CREATE TABLE Student(Reg_No VARCHAR(225), Name VARCHAR(20), Gender VARCHAR(6), Department VARCHAR(3), CGPA INT(5),Address VARCHAR(20), Contact_No INT(10), mail_Id VARCHAR(30))")

In [47]:
dbase.execute("SHOW TABLES")

for table in dbase:
    print(table)

('student',)

In [48]:
for row in range(2,ws.max_row+1):
    sql = "INSERT INTO student(Reg_No, Name, Gender, Department, CGPA, Address, Contact_No, mail_Id) VALUES (%s,%s,%s,%s,%s,%s,%s,%s)"
    for _ in range(1):
        Reg_No = ws.cell(row, 1).value
        Name = ws.cell(row, 2).value
        Gender = ws.cell(row, 3).value
        Department = ws.cell(row, 4).value
        CGPA = ws.cell(row, 5).value
        Address = ws.cell(row, 6).value
        Contact = ws.cell(row, 7).value
        mail = ws.cell(row, 8).value
        
        values = (Reg_No,Name,Gender,Department,CGPA,Address,Contact,mail)
        dbase.execute(sql, values)
        
con.commit()

In [51]:
dbase.execute("SELECT * FROM student")
database = dbase.fetchall()

for data in database:
    print(data)

('6001', 'Arthur', 'Male', 'ECE', 8, 'Chennai', 987654321, 'arthur@gmail.com')
('6002', 'Chandler', 'Male', 'CSE', 8, 'Nagercoil', 987654322, 'chandler@gmail.com')
('6003', 'Harry', 'Male', 'EEE', 7, 'Madurai', 987654323, 'harry@gmail.com')
('6004', 'Joey', 'Male', 'CSE', 8, 'Thiruchi', 987654324, 'joey@gmail.com')
('6005', 'Michael', 'Male', 'ECE', 9, 'Chennai', 987654325, 'michael@gmail.com')
('6006', 'Monica', 'Female', 'CSE', 9, 'Coimbatore', 987654326, 'monica@gmail.com')
('6007', 'Phoebe', 'Female', 'ECE', 8, 'Nagercoil', 987654327, 'phoebe@gmail.com')
('6008', 'Rachel', 'Female', 'ECE', 9, 'Thiruchi', 987654328, 'rachel@gmail.com')
('6009', 'Ross', 'Male', 'EEE', 8, 'Coimbatore', 987654329, 'ross@gmail.com')
('6010', 'Skyler', 'Female', 'CSE', 7, 'Nagercoil', 987654330, 'skyler@gmail.com')
('6011', 'Thomas', 'Male', 'EEE', 9, 'Chennai', 987654331, 'thomas@gmail.com')
('6012', 'Walter', 'Male', 'EEE', 8, 'Madurai', 987654332, 'walter@gmail.com')

In [52]:
con.close()